Query_WebService.txt

<?xml version="1.0" encoding="utf-8"?>
<soap:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
<soap:Body>
<GetListItems xmlns="http://schemas.microsoft.com/sharepoint/soap/">
<listName>{Common:ListName}</listName>
<viewName></viewName>
<query>
<Query>
<Where>
<Eq>
<FieldRef Name="Title" />
<Value Type="Text">A</Value>
</Eq>
</Where>
</Query>
</query>
<viewFields></viewFields>
<rowLimit></rowLimit>
<queryOptions xmlns:SOAPSDK9=
"http://schemas.microsoft.com/sharepoint/soap/" >
<QueryOptions/>
</queryOptions>
<webID></webID>
</GetListItems>
</soap:Body>
</soap:Envelope>